
DROP TABLE account;

CREATE TABLE account (
    email varchar(50) NOT NULL,
    password varchar(50) NOT NULL,
    PRIMARY KEY (email)
) ;



DROP TABLE address;

CREATE TABLE address (
    addressid integer NOT NULL GENERATED ALWAYS AS IDENTITY (START WITH 1, INCREMENT BY 1),
    receivername varchar(50) NOT NULL,
    addressline1 varchar(100) NOT NULL,
    addressline2 varchar(100),
    district varchar(50) NOT NULL,
    city varchar(50) NOT NULL,
    province varchar(50) NOT NULL,
    postalcode varchar(5) NOT NULL,
    PRIMARY KEY (addressid)
);

DROP TABLE customer;

CREATE TABLE customer (
    email varchar(50) NOT NULL,
    firstname varchar(50) NOT NULL,
    lastname varchar(50) NOT NULL,
    phonenumber varchar(10) NOT NULL,
    lastaddress integer,
    PRIMARY KEY (email),
    CONSTRAINT account_cus_id FOREIGN KEY (email) REFERENCES account (email),
    CONSTRAINT account_cus_add FOREIGN KEY (lastaddress) REFERENCES address (addressid)
);

INSERT INTO account(email,password) values
('khanysorn@outlook.com','e1adc3949ba59abbe56e057f2f883e');

INSERT INTO address(receivername,addressline1,addressline2,district,city,province,postalcode) values 
('คณิศร ชัยวิชาชาญ','ใต้ฟ้า','บนดิน','หาดใหญ่','หาดใหญ่','สงขลา',90110);

DROP TABLE product;

CREATE TABLE category (
    categoryid integer NOT NULL,
    categoryname varchar(50) NOT NULL,
    PRIMARY KEY(categoryid)
);

INSERT INTO category(categoryid,categoryname) values 
(1,'ด้านร่างกาย'),
(2,'ด้านสติปัญญา'),
(3,'ด้านสังคม'),
(4,'ด้านอารมณ์');

CREATE TABLE product (
    productid integer NOT NULL,
    productname varchar(100) NOT NULL,
    productcategory integer NOT NULL,
    productforage varchar(3),
    materialofproduct varchar(50),
    productdescription varchar(500),
    productPrice decimal(10,2) NOT NULL,
    PRIMARY KEY (productid),
    CONSTRAINT product_pro_cate FOREIGN KEY (productcategory) REFERENCES category (categoryid),
);

INSERT INTO product (productid,productname,productcategory,productforage,materialofproduct,productdescription,productPrice) VALUES
(1,'Peek-a-Boo Barn Baby & Toddler Toy',2,'1','ไม้คุณภาพดี ขอบมน ขัดอย่างดี ของเล่นเข้าปากได้โดยไม่เป็นอันตราย','ดึงดูดความสนใจของเด็กได้ ด้วยวิธีเล่นง่าย ๆ แบบเปิด - ปิดเห็นสัตว์ที่ซ่อนอยู่เป็นในบ้าน เหมือนเล่นซ่อนแอบ เปิดประตูหาตัวสัตว์ พลิกได้ กลับได้ เปิดได้ ปิดได้ ของเล่นเหมาะสำหรับเด็กเล็ก ส่งเสริมให้เล่นและคิดค้นค้นหาด้วยตนเอง',395),
(2,'Farm Animals Touch and Feel Puzzle',1,'1','ไม้คุณภาพดี','Touch & Feel Puzzle แต่ละชิ้นที่เป็นรูปสัตว์จะมีผ้า หรือพื้นผิวที่มี texture แตกต่างกัน บางอันนุ่ม บางอันขรุขระ บางอันข้นสั้น บางอันเรียบ บางอันเป็นหนัง ส่งเสริมให้เด็ก ๆ ได้ทดลองจับ ทดสอบ และ เรียนรู้ถึงความรู้สึก ตื่นเต้นและน่าสนใจสำหรับเด็กเล็ก ๆ ชิ้นใหญ่ จับง่าย ส่งเสริมให้เด็กมีความสนใจกับการสำรวจสิ่งรอบข้างได้เป็นอย่างดี ทำจากไม้คุณภาพดีทั้งหมด เหมาะสำหรับเป็นพัซเซิลแรก ๆ ของเด็ก
',595),
(3,'House Pets Jumbo Knob',2,'1','พัซเซิลขอบมน ทำจากไม้คุณภาพดี','พัซเซิลเป็นของเล่นที่ส่งเสริมพัฒนาการเด็ก ๆ ได้ดี โดยเริ่มเป็นพัซเซิลชิ้นจัมโบ้ ตุ่มใหม่พิเศษ ฝึกการเรียนรู้การบังคับมือกล้ามเนื้อมัดใหญ่ การคิดและเห็นภาพที่สอดคล้อง การแก้ปัญหา และฝึกให้เล่นจากง่าย ๆ ก่อน อย่างพัซเซิลนี้เป็นต้นไป แล้วจะได้ไปต่อยอดพัซเซิลหลากชิ้นยาก ๆ ขึ้นได้อีก',650),
(4, 'First Bead Maze',2,'1','ทำจากไม้อย่างดี ใช้สีและวัสดุทั้งหมดที่ปลอดภัยกับเด็ก และฐานที่ทำจากจุกยางสูญญากาศ','สีสันสดใสและรูปร่างเล็ก ๆ หลากหลายแบบช่วยดึงดูดความสนใจ ส่งเสริมให้เด็กเล็กเรียนรู้สี การแยกแยะรูปร่าง ช่วยฝึกการบังคับมือและการตอบสนองของมือด้วย ชิ้นส่วนทั้งหมดร้อยอยู่ในห่วง จึงปลอดภัยกับเด็กเล็ก นิยมมากที่ในเนอร์เซอรี่เด็กในอเมริกา มาพร้อมจุกยางที่ฐาน เอาไปติดกับพื้นหรือบนเก้าอี้กินข้าวของเด็กก็ได้',895),
(5, 'Clacking Key Ring',2,'1','ทำจากวัสดุและสีที่ปลอดภัยทุกชนิด ทนทาน เข้าปากได้ไม่เป็นอันตราย','ห่วงคล้องเก็บกุญแจและมีที่เสียบไขได้จริง กุญแจ 4 ดอก หลากสีและรูปร่าง เรียนรู้การบังคับมือให้ตอบสนองกับสมอง เรียนรู้สี และรูปร่างได้อย่างสนุก ชุดเล่นไขกุญแจชุดนี้เหมาะสำหรับเป็นของเล่นไม้แรก ๆ ของเด็ก ๆ เล่นไขกุญแจ เสียบ ถอดกุญแจ สังเกตุรูปร่างและสีที่แตกต่าง เขย่าให้เกิดเสียง เสียบเข้า ถอดออก และหมุนกุญแจเล่นได้อย่างไม่สิ้นสุด',495),
(6,'Shopping Cart',1,'1','ทำจากเหล็กอย่างดี คุณภาพดี ทนทาน','รถเข็นเล็ก ๆ ขนาดเหมาะสำหรับน้อง ๆ ช่วยพยุงตัวตอนกำลังหัดเดินได้ด้วย เหมือนรถเข็นในซูเปอร์เลยแต่ขนาดเล็ก ๆ สำหรับเด็ก เข็นได้จริง สวมบทบาทซื้อของเหมือนคุณแม่ ความจุสูง',3700),
(7,'Match & Roll Shape Sorter',2,'1','ทำจากวัสดุและสีที่ปลอดภัยทุกชนิด ทนทาน เข้าปากได้ไม่เป็นอันตราย','บล็อกหยอดที่เสริมทักษะพื้นฐานจำเป็นของน้อง ๆ แล้ว ยังกลิ้งและหมุนได้ด้วย หมุนเพื่อหาด้านที่สอดคล้องกับสี กลิ้งเพื่อดูการหมุน การไหล และใส่ให้ตรงช่อง',1095),
(8,'Maritime Mates Boat Parade',4,'1','ทำจากพลาสติก ทนทาน และเข้าปากได้ไม่เป็นอันตราย','ของเล่นลอยน้ำรูปเรือ 3  ลำ มีสีสนสดใส เพื่อเพิ่มความสนุกระหว่างการอาบน้ำ หรือการเล่นน้ำในสระ โดยจะมีหมุดพลาสติกติดอยู่ที่เรือแต่ละลำ เมื่อหมุนที่หมุนนั้นจะทำให้เรือสามารถแล่นได้',695),
(9,'Toolbox Fill and Spill',1,'1','ทำจากผ้าคุณภาพดี','ชุดเล่นเครื่องมือ ทำจากวัสดุผ้าคุณภาพดีทั้งหมด เหมาะสำหรับเด็ก ๆ ที่เพิ่งเริ่มหัดเล่นการสวมบทบาท การเลียนแบบคนรอบข้าง ส่งเสริมการเล่นอย่างมีจินตนาการ ฝึกการบังคับมือให้สอดคล้องกับสมอง',1395),
(10,'Stacking Cars Baby & Toddler Toy',1,'1','ทำจากไม้ขอบมน สีที่ปลอดภัย และล้อที่ทำจากพลาสติก','รถเข็นของเล่น มาพร้อมรถทั้งหมด 3 คัน จับรถแล้วหมุน ๆ ดัน ๆ เหมาะสำหรับเด็กเล็กๆที่ชอบการเคลื่อนไหว ส่งเสริมพัฒนาการเรียนรู้ ความสอดคล้องของการบังคับมือ เล่นสนุก หลากสี เล่นง่าย ทำจากวัสดุปลอดภัยสำหรับเด็กเล็ก ๆ โดยเฉพาะ',495),
(11, 'Learning Mat Crayons - Wipe-off!', 3, '2', 'ทำจากไม้ขอบมน สีที่ปลอดภัย และล้อที่ทำจากพลาสติก', 'สีเทียนที่เขียนแล้วเช็ดออกได้ด้วยผ้าหมาด ๆ เมื่อเขียนบนพื้นผิวที่เรียบมันทุกแบบ เช่น กระจก กระดานไวท์บอร์ด หรือกระเบื้องห้องน้ำ ใน 1 ชุดมี 5 แท่ง ส่งเสริมจินตนาการการวาดเขียน และการเรียนรู้ทักษะพื้นฐานทั้งหมด', 150),
(12, 'Rainbow Stamp Pad', 2, '2','หมึกระบบน้ำแบบปลอดสารพิษ เก็บในกล่องพลาสติก สามารถซักล้างออกได้' , 'เป็นแท่นหมึกที่มี 6 สีด้วยกัน ม่วง น้ำเงิน เขียว เหลือง ส้ม และ แดง เป็นหมึกปลอดสารพิษที่ซักล้างออกได้ หมึกระบบน้ำสำหรับเด็กโดยเฉพาะ มาพร้อมกล่องพลาสติกอย่างดี เก็บได้นานไม่แห้งง่าย', 350),
(13, 'See-inside Peg Puzzles - Numbers', 2, '2', 'ทำจากไม้อย่างดี ขอบมน และสีที่ปลอดภัย', 'พัซเซิลแบบมีตุ่ม หรือ Peg Puzzle จำนวน 10 ชิ้น ตามตีม คลาสสิค ส่งเสริมพัฒนาการทางความคิด การบังคับมือให้สอดคล้องกับสมอง ส่งเสริมกล้ามเนื้อมัดเล็กและมัดใหญ่', 399),
(14, 'Wooden Animal Magnets', 2, '2', 'ทำจากแม่เหล็ก', 'ชิ้นแม่เหล็กรูปสัตว์สารพัดแบบ แม่เหล็กทั้งตัว มีทั้งสัตว์น้ำ สัตว์บก สัตว์เลี้ยง สัตว์ป่า สารพัดแบบจำนวน 20 ชิ้น เล่นสวมบทบาท บอกเรื่อง ต่อเป็นแบบต่าง ๆ เรียนรู้คำศัพท์ และส่งเสริมการเล่นแบบมีจินตนาการ', 595),
(15, 'Sound Block Puzzle', 2, '2', 'ตัวบล็อกทำจากไม้อย่างดี ขอบมน', 'เป็นพัซเซิลแบบบล็อก แต่ละด้านของบล๊อคไม้จะมีรูปที่แตกต่างกัน (รวมทั้งหมด 6 รูป) 1 รูปต่อหนึ่งด้าน เมื่อวางพัซเซิลภาพเดียวกันของบล๊อคสองลูกให้เข้ากันถูกต้อง พัซเซิลจะมีเสียงสอดคล้องกับรูปภาพดังขึ้นเองขึ้นเอง โดยอัตโนมัติด้วยระบบเซนเซอร์', 450),
(16, 'Rainbow Stacker', 2, '2', 'ทำจากไม้อย่างดี สีและวัสดุทั้งหมดที่ใช้ในการผลิตปลอดภัยกับเด็ก', 'หอคอยสีรุ้ง เป็นการต่อห่วงหลากสีเป็นทักษะพื้นฐานที่ธรรมชาติ สีสันสดใส ผิวขัดมันเล่นสบาย ช่วยเสริมทักษะเรื่องรูปร่าง สี และขนาดเล็กใหญ่ให้เด็ก มีทั้งหมด 8 ชิ้นไม้ต่างสี ใช้วางซ้อนกันบนแกนไม้ ฐานโยกได้', 399),
(17, 'Wooden Shapes and Colors Magnets', 2, '2', 'ทำจากไม้อย่างดี สีและวัสดุทั้งหมดที่ใช้ในการผลิตปลอดภัยกับเด็ก', 'สารพัดรูปของรูปทรงทั่วไป และรูปทรงเรขาคณิตทั้งหมด พร้อมสอนคำศัพท์ไปในตัวด้านหลังกล่อง เล่นหา แปะ แมชชิ่งได้สารพัดแบบ มาพร้อมกล่องไม้และฝาปิดอย่างดีสำหรับเก็บ', 595),
(18, 'Mini Puzzle Pack - Animals', 2, '2', 'ทำจากไม้อย่างดี สีและวัสดุทั้งหมดที่ใช้ในการผลิตปลอดภัยกับเด็ก', 'พัซเซิลรูปสัตว์ เป็นเซ็ท 4 แผ่น มีพัซเซิลแผ่นละ 4 ชิ้น เป็นตีมสัตว์ฟาร์ม สัตว์น้ำ ซาฟารี และ สัตว์เลี้ยง ครบรูปสัตว์ทั้งหมดรวม 16 ชิ้นด้วยกัน มีรูปภาพที่สอดคล้องอยู่ใต้ตัวพัซเซิลด้วย เล่นง่ายและสนุก', 595),
(19, 'Stack and Sort Board', 3, '2', 'ทำจากไม้อย่างดี สีและวัสดุทั้งหมดที่ใช้ในการผลิตปลอดภัยกับเด็ก', 'เล่นโดยเอาแต่ละชิ้นมาร้อยที่แท่งไม้บนฐานไม้ให้ถูกอัน ฝึกทักษะการบังคับมือ แต่ละชิ้นมีขนาดใหญ่ เล่นง่าย มีทั้งหมด 15 ชิ้น มี 5 รูปร่างและ 5 สีด้วยกัน มาพร้อมแกนกับฐานไม้ มีตัวเลขและรูปร่างที่สอดคล้องเขียนบอกอยู่บนฐาน', 695),
(20, 'Shape Sorting Cube', 2, '2', 'ทำจากไม้อย่างดี ขอบมน สีที่ใช้ในการผลิตปลอดภัยกับเด็ก', 'บล็อกหยอดชุดนี้ มีชิ้นรูปร่างหลากหลายทั้งหมด 12 ชิ้น ชิ้นใหญ่ที่จับง่ายสำหรับมือของเด็ก หลากสี เขียว น้ำเงิน เหลือง แดง ช่วยดึงดูดความสนใจของเด็ก เมื่อหยอดเข้าหมดแล้ว สามารถเปิดฝาและเทชิ้นบล๊อคออกได้โดยง่าย ทำได้ด้วยตนเอง แล้วเล่นใหม่ได้ทันที', 895),
(21, 'Reusable Sticker Pad - Adventure', 3, '3', 'สติ๊กเกอร์แบบที่เป็นแผ่น non-stick', 'สมุดสติกเกอร์ ที่มาพร้อมสติกเกอร์กว่า 70 ชิ้น และฉากหลังตามตีม 3 ฉาก รุ่นนี้เป็นตีมผจญภัยมีสติ๊กเกอร์สารพัดแบบที่เป็นแผ่น non-stick ใช้เล่นสติ๊กเกอร์ได้หลายครั้ง เล่นแล้วแกะออกและเล่นใหม่ได้', 375),
(22, 'Make a Meal Sticker Pad', 3, '3', 'ทำจากกระดาษสติ๊กเกอร์อย่างดี', 'สติกเกอร์ 225 ชิ้น พร้อมฉากหลัง 20 ฉาก ตีมจัดชุดอาหาร ส่งเสริมจินตนาการ สอนเรื่องอาหาร และการนั่งบนโต๊ะ ส่งเสริมการเล่นบทบาทสมมุติ', 375),
(23, 'Paint with Water - Safari', 3, '3', 'แป้นสี และกระดาษพิเศษที่สีจะติดบนกระดาษเท่านั้น', 'สมุดระบายสีด้วยพู่กัน แต่ละหน้ามีแป้นสีมาในตัว เป็นสีแบบไม่เลอะเทอะ มาพร้อมพู่กันในชุด แค่เอาพู่กันจุ่มน้ำ แล้วแต้มแป้นสีในแผ่นจากนั้นเริ่มระบายสีบนกระดาษพิเศษ ที่จะออกสีบนกระดาษเท่านั้น มีทั้งหมด 20 แผ่นหลากสไตล์ที่น่าสนใจตีมสัตว์ซาฟารี', 295),
(24, 'Jumbo Complete The Picture Pads', 3, '3', 'กระดาษแผ่นใหญ่อย่างดี', 'สมุดวาดภาพที่มาพร้อมฉากหลังแตกต่างกัน 12 แบบ ทั้งรูปคน รูปสัตว์ รูปธรรมชาติ รูป บ้าน รูปฟาร์ม และอื่นๆอีกมากมาย ให้เด็ก ๆ ได้วาดภาพเองให้สอดคล้องกับฉากหลัง ดึงดูดความสนใจ ส่งเสริมควมคิดริเริ่มสร้างสรรค์ได้', 295),
(25, 'Write-A-Mat Learning Mat - Phonics', 3, '3', 'REUSABLE แผ่นขนาดใหญ่', 'เขียนและระบายสีเทียนแล้วลบออกได้ด้วยผ้าหมาด ๆ ให้ใช้กับสีเทียนแบบลบออกได้ มีสองด้านที่แตกต่างกัน ใช้เป็นแผ่นรองจานขณะทานข้าวได้ด้วย', 150),
(26, 'Truck Crayon Set',3 , '3', 'สีเทียน Non-toxic พร้อมกล่องพลาสติก', 'ชุดสีเทียน Non-toxic แท่งสามเหลี่ยมไม่กลิ้งหล่น แข็งแรงพิเศษ ไม่หักง่าย บรรจุพร้อมกล่องพลาสติกรูปรถอย่างดี เหมาะสำหรับพกพา ขนาดพกพา 12 แท่ง', 250),
(27, 'Non-toxic Sidewalk Chalk', 1, '3', 'ชอล์คแบบ Non-toxic พร้อมปลอกจากพลาสติก', 'ชอล์คสำหรับเด็ก Non-toxic พร้อมปลอกกันเปื้อนจะได้ไม่ต้องสัมผัสชอล์ค และป้องกันชอล์คไม่ให้หักง่ายปลอกแบบอ้วนกลม เหมาะสำหรับมือเล็ก ๆ ของเด็ก ปรับความยาวแท่งที่ยื่นออกมาได้สะดวก', 350),
(28, 'Can Opener and Cans', 1, '3', 'พลาสติกอย่างดี ทนทานและปลอดภัย', 'เล่นสวมบทบาทเปิดกระป๋อง เลียนแบบคุณแม่ได้อย่างปลอดภัย เรียนรู้การบังคับมือ และการผสม Mix & Match ในชุดมีที่เปิดกระป๋อง 1 อัน และกระป๋องพร้อมฝาปิดแบบพิเศษ 2 เซ็ท', 355),
(29, 'WATER WOW REUSABLE - Connect The Dots!', 3, '3', 'ด้ามจับทำจากพลาสติกอย่างดี ส่วนสีเป็นแบบปราศจากสารเคมี', 'สมุดระบายสีชุดนี้ แค่เอาน้ำใส่ปากกา แล้วเริ่มแต้มบนแผ่นรูปภาพ สีต่าง ๆ ก็จะปรากฎออกมาเอง พอแห้ง สีจะหายไป และเริ่มเล่นใหม่ได้อีก มาพร้อมรูปภาพต่าง ๆ ที่น่าสนใจตามตีม', 375),
(30, 'Finger Paint Set (4 colors)', 3, '3', 'สีเพ้นท์มือปลอดสารแบบเนื้อเจล', 'Finger Paint Set ส่งเสริมการเล่นทางศิลปะ Non-toxic ปลอดภัยกับเด็กทุกวัย บรรจุมาในกระปุกที่มีฝาปิดในตัว เล่นแล้วเก็บได้สะดวก ใช้งานได้นาน', 395),
(31, 'Alphabet Sorting Puzzle Cards', 2, '4', 'ทำจากไม้ขอบมนอย่างดี', 'มีพัซเซิลตัวอักษร 26 คู่ แต่ละคู่มีอักษรเล็ก a-z คู่กับอักษรใหญ่ A-Z พร้อมคำศัพท์สอดคล้องกับตัวอักษร และมาพร้อมรูปภาพด้วย ตัวอักษรและรูปภาพมีสีที่สัมพันธ์กัน เป็นสินค้าดีไซน์ให้การเรียนรู้ตัวอักษรภาษาอังกฤษที่มีทั้งอักษรเล็กและอักษรใหญ่ง่ายเป็นพิเศษ แต่ละคู่ของพัซเซิลใส่ลงล๊อคได้เฉพาะคู่ของมันเองเท่านั้น', 535),
(32, 'Self-Correcting Number Puzzle', 2, '4', 'ทำจากไม้ขอบมนอย่างดี', 'พัซเซิลจับคู่ตัวอักษรให้เข้ากับคำศัพท์และรูปภาพ หากไม่ถูกจะต่อไม่เข้าเอง Self-correcting ให้เด็ก ๆ หัดเรียนรู้ด้วยตนเอง มีตัวเลข 1-20 มาพร้อมกล่องไม้สำหรับเก็บอย่างดี', 'พัซเซิลจับคู่ตัวอักษรให้เข้ากับคำศัพท์และรูปภาพ หากไม่ถูกจะต่อไม่เข้าเอง Self-correcting ให้เด็ก ๆ หัดเรียนรู้ด้วยตนเอง มีตัวเลข 1-20 มาพร้อมกล่องไม้สำหรับเก็บอย่างดี', 795),
(33, 'Construction Set in a Box', 2, '4', 'ทำจากไม้ขอบมนอย่างดี สีที่ใช้ในการผลิตปลอดภัยกับเด็ก', 'อได้ สร้างได้ หลากหลายสี มีทั้งน๊อต สกรู ไขควง คาน ล้อ ฯลฯ หลากหลายรูปร่าง ส่งเสริมพัฒนาการด้านความคิดริเริ่มสร้างสรรค์ การบังคับมือ การสร้าง การทำโปรเจคด้วยตนเอง ต่อเป็นสิ่งต่าง ๆ ได้ไม่รู้จบ มีแบบคู่มือแนะนำในเล่มด้วย', 1095),
(34, 'Wooden Bead Set - Heart', 2, '4', 'ทำจากไม้ขอบมนอย่างดี สีที่ใช้ในการผลิตปลอดภัยกับเด็ก', 'ชุดฝึกร้อยเชือกทำเครื่องประดับ ลูกปัดทุกชิ้นทำจากไม้อย่างดี และสีที่ไม่เป็นอันตราย มีทั้งลูกปัดและเชือกเส้นใหญ่ 3 เส้น ร้อยง่าย มาครบชุดพร้อมเริ่ม', 325),
(35, '.DIY Set - Train', 2, '2', 'ทำจากไม้ขอบมนอย่างดี สีที่ใช้ในการผลิตปลอดภัยกับเด็ก', 'สำหรับเด็กที่ชอบเล่นกับรถไฟ ชุดตกแต่งรถไฟอันนี้จะช่วยฝึกความตั้งใจ การมีสมาธิ และจินตนาการทางศิลปะได้ นำเข้าและออกแบบจากอเมริกา มาครบชุดทั้งรถไฟไม้ ล้อไม้ แกนล้อไม้ สีสำหรับทา 4 สี พู่กัน สติ๊กเกอร์ และกาว พร้อมเล่นตกแต่งรถไฟให้เป็นเอกลักษณ์ของตัวเองได้ทันที', 350),
(36, '3D Coloring Book!', 2, '4', 'กระดาษอย่างดี เมื่อสวนแว่น 3 มิติ สามารถเห็นภาพแบบ 3 มิติได้', 'สมุดระบายสีตามจุด 3 มิติ โดยแต่ละแผ่นจะมีจุดแนะนำสีของแต่ละช่อง และฉากหลังเมื่อใส่แว่น 3D แล้วจะนูนออกมาเป็นลูกเล่นที่น่าสนใจ', 295)
(37,  'Reusable Chalk Activity Book', 2, '4', 'ชอล์คปลอดภัย ไร้ฝุ่น ไม่แพ้ง่าย', 'ชุดสมุดกิจกรรมชอล์ค มาเป็นเล่มสมุดกิจกรรม 20 แผ่นที่หลากหลาย ทั้งเกมต่อจุด ระบายสีตามจุด วาดภาพตามแบบ วาดภาพตามตีม เล่น Tic Tac Toe (เกม XOXO)', 350),
(38, 'Reusable Tape tape Activity Book', 'กิจกรรมแปะเทป ในชุดมีแผ่นกิจกรรมที่หลากหลาย 20 กิจกรรม พร้อมเทปสีรียูสซาเบิล 4 ม้วน เล่นแปะ ติด ประดิษฐ์ สร้าง เล่นแล้วเล่นอีกได้เพราะกระดาษเป็นแบบแข็งและมัน แปะเทปแล้วแกะออกแปะใหม่ได้ไม่รู้จบ', 350),
(39, 'Classroom Stamp Set', 2, '4', 'หมึกปลอดสารพิษและล้างออกได้ สี ยาง และไม้ผลิตจากวัสดุที่ปลอดภัยต่อเด็ก', 'ในชุดมีแสตมป์ตามตีม 8 ชิ้น มาพร้อมหมึกปลอดสารพิษและล้างออกได้ 2 สี และดินสอสี 5 แท่งในชุด มาในกล่องไม้อย่างดีสำหรับเก็บ ทุกอย่างครบสำหรับเริ่มจินตนาการ ทำด้วยยางและไม้อย่างดี ปลอดภัยทั้งหมด ส่งเสริมการเล่นอย่างมีจินตนาการ', 795),
(40, 'See and Spell', 2, '4', 'ทำจากไม้ขอบมนอย่างดี และสีที่ปลอดภัยต่อเด็ก', 'ในชุดมีบอร์ดสะกดคำ 2 ด้าน จำนวน 8 แผ่น รวมคำศัพท์ 16 คำ มาพร้อมตัวอักษรไม้อย่างดีจำนวน 60 ตัว ผสมผสานคำได้หลากหลาย เรียนรู้ได้ในขณะเล่นอย่างท้าทาย', 1195),
(41, 'Write-A-Mat Learning Mat - Telling Time & Clock', 2, '5', 'กระดาษประเภท REUSABLE', 'REUSABLE แผ่นขนาดใหญ่ เขียนและระบายสีเทียนแล้วลบออกได้ด้วยผ้าหมาด ๆ ให้ใช้กับสีเทียนแบบลบออกได้ มีสองด้านที่แตกต่างกัน ใช้เป็นแผ่นรองจานขณะทานข้าวได้ด้วย', 150),
(42, 'Peel and Press Stickers on Stained Glass', 2, '5', 'สติ๊กเกอร์และแผ่นพลาสติกแบบโปร่งแสง', 'เป็นชุดประกอบด้วยแผ่นพลาสติกที่โปร่งแสงซึ่งที่มีลายเป็นรูปสัตว์ และสติกเกอร์แบบนูน แบบแวววาวถึงกว่า 80 ชิ้น ติดสติกเกอร์ตามตัวเลขที่บอกไว้บนแผ่นงาน จากเลข 1 ถึง 80 เมื่อเสร็จแล้ว จะได้ผลงานเป็นรูปที่สมบูรณ์สวยงาม', 395),
(43, 'Suspend Family Game', 2, '5', 'ชิ้นเหล็กทำจากลวด', 'เป็นเกมครอบครัว เล่นโดยการโยนลูกเต๋า ผลัดกันเลือกขิ้นเหล็กที่มีความยาวไม่เท่ากัน มาเกี่ยว มาต่อบนฐานแกนหลัก ใครทำล้มก่อนคนนั้นแพ้ ส่งเสริมความสัมพันธ์ของเพื่อน ๆ และคนในครอบครัว เป็นของเล่นได้รางวัล ส่งเสริมให้เด็กแก้ไขปัญหา เล่นเกมที่ไม่ต้องใช้เทคโนโลยีหรือคอมพิวเตอร์ เล่นได้ตั้งแต่ 1 ถึง 4 คน', 895),
(44, 'World Map Floor', 2, '5', 'ทำจากการะดาษแข็งพิมพ์ลายเงา', 'พัซเซิลรูปแผนที่โลก รวม 33 ชิ้นจัมโบ้ เมื่อต่อแล้วมีขนาดใหญ่ถึง 90 ซม x 60 ซม ส่งเสริมการเรียนรู้สิ่งรอบตัว เป็นชุดที่ส่งเสริมการรู้จักประเทศของโลก สิ่งรอบตัวระดับกว้างได้เป็นอย่างดี', 650),
(45, 'Write-A-Mat Learning Mat Planets', 2, '5', 'ทำจากกระดาษแผ่นใหญ่ประเภท REUSABLE', 'REUSABLE แผ่นขนาดใหญ่ เขียนและระบายสีเทียนแล้วลบออกได้ด้วยผ้าหมาด ๆ ให้ใช้กับสีเทียนแบบลบออกได้ มีสองด้านที่แตกต่างกัน ใช้เป็นแผ่นรองจานขณะทานข้าวได้ด้วย กินไป เล่นไป และเรียนรู้ไปในตัว เมื่อทานเสร็จแล้วก็ทำความสะอาดเช็ดออกทีเดียว เช็ดแล้วเขียนใหม่ได้ไม่จำกัด', 375),
(46, 'Decoupage', 2, '5', 'ทำจากกระดาษ', 'ชุดตกแต่งแปะรูปปั้น ชุดนี้มาพร้อมอุปกรณ์ครบชุดเพื่อประดิษฐ์และตกแต่งตัวปั้นรูปสัตว์ แปะสติกเกอร์ให้ครอบคลุมทั้งตัว แปะชิ้นเล็กชิ้นใหญ่ให้เหลือมกันตามดีไซน์ที่ต้องการ แปะตาตกแต่ง ผูกโบว์ แล้วทากาวพิเศษที่มาในชุด รอให้แห้ง แค่นี้ก็จะได้รูปปั้น Decoupage อย่างดี', 595),
(47, 'Decoupage', 2, '5', 'ทำจากกระดาษ','ชุดตกแต่งแปะรูปปั้น ชุดนี้มาพร้อมอุปกรณ์ครบชุดเพื่อประดิษฐ์และตกแต่งตัวปั้นรูปสัตว์ แปะสติกเกอร์ให้ครอบคลุมทั้งตัว แปะชิ้นเล็กชิ้นใหญ่ให้เหลือมกันตามดีไซน์ที่ต้องการ แปะตาตกแต่ง ผูกโบว์ แล้วทากาวพิเศษที่มาในชุด รอให้แห้ง แค่นี้ก็จะได้รูปปั้น Decoupage อย่างดี', 595),
(48, 'Sandblox - 7-Piece Sand Shaping Set', 3, '5', 'ทำจากพลาสติก', 'ชุดเล่นทราย นิมิตงานสร้างสรรค์จากทรายได้ไม่รู้จบ ในชุดมีอุปกรณ์ 7 ชิ้น ทำจากวัสดุคุณภาพดี ทนทาน และ ปลอดภัยทั้งหมด เหมาะสำหรับเด็ก ๆ หลายวัย', 1095),
(49, 'Skippy Hopscotch', 3, '5', 'แผ่นกระโดดทำจากยาง', 'แผ่นกระโดดแบบตัวเลขรูปกบ เหมาะสำหรับการเล่นภายในบ้านและกลางแจ้ง พกพาสะดวก มีน้ำหนักเบา ทำจากวัสดุคุณภาพดี ทนทาน และปลอดภัยทั้งหมด เหมาะสำหรับเด็ก ๆ หลายวัย', 1395),
(50, 'Pop-up Posters On-The-Go Activity - Butterflies', 2, '5', 'ทำจากกระดาษแข็งอย่างดี', 'สมุดกิจกรรมระบายสี 8 แผ่น แต่ละแผ่นเมื่อระบายแล้ว สามารถ “ป๊อบอัพ” ตั้งขึ้นมาเป็นรูป 3D ที่มีความลึกได้ ส่งเสริมความสนใจทางด้านศิลปะ', 265) ;

